Revit 2026 API

# ExternalServiceId Properties

---

The ExternalServiceId type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Guid | The Guid of GUID-based enum object. (Inherited from GuidEnum) |

#### Reference

ExternalServiceId Class

Autodesk.Revit.DB.ExternalService Namespace